# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [43]:
import pandas as pd

data = {'Company':['GOOG','MSFT','MSFT','GOOG','FB','FB'],
       'Person':['Sam','Kat','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,150,340,124,243,350]}

In [44]:
df = pd.DataFrame(data)

In [45]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    MSFT      Kat    150
2    MSFT      Amy    340
3    GOOG  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [46]:
df.groupby('Company').groups

{'FB': Int64Index([4, 5], dtype='int64'),
 'GOOG': Int64Index([0, 3], dtype='int64'),
 'MSFT': Int64Index([1, 2], dtype='int64')}

You can save this object as a new variable:

In [47]:
by_comp = df.groupby('Company')

And then call aggregate methods off the object:

In [48]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     162.0
MSFT     245.0

More examples of aggregate methods:

In [49]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      53.740115
MSFT     134.350288

In [50]:
by_comp.min()

        Person  Sales
Company
FB        Carl    243
GOOG       Sam    124
MSFT       Amy    150

In [51]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG     Vanessa    200
MSFT         Kat    340

In [52]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [53]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  162.0   53.740115  124.0  143.00  162.0  181.00  200.0
MSFT      2.0  245.0  134.350288  150.0  197.50  245.0  292.50  340.0

In [54]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  162.000000  245.000000
      std     75.660426   53.740115  134.350288
      min    243.000000  124.000000  150.000000
      25%    269.750000  143.000000  197.500000
      50%    296.500000  162.000000  245.000000
      75%    323.250000  181.000000  292.500000
      max    350.000000  200.000000  340.000000

In [55]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     162.000000
       std       53.740115
       min      124.000000
       25%      143.000000
       50%      162.000000
       75%      181.000000
       max      200.000000
Name: GOOG, dtype: float64

In [56]:
by_comp.describe().T

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  162.000000  245.000000
      std     75.660426   53.740115  134.350288
      min    243.000000  124.000000  150.000000
      25%    269.750000  143.000000  197.500000
      50%    296.500000  162.000000  245.000000
      75%    323.250000  181.000000  292.500000
      max    350.000000  200.000000  340.000000